<!DOCTYPE HTML>
<html>
<head>
<title>Технотренди</title>
<meta charset="utf-8"/>
<link rel="stylesheet" href="style/style.css" type="text/css">
</head>
<body>
<div id="wrapper">
<header>Технотренди</header>
<div id="header"><img src="4.jpg" width=1224px height=386px></div>
<ul class="css-menu">
<li><a href="">Головна</a></li>
<li><a href="01.html">Дрони</a></li>
<li><a href="02.html">Віртуальна реальність</a></li>
<li><a href="03.html">Інтернет речей</a></li>
<li><a href="04.html">3D</a></li>
</ul>
<div id="leftbar">
<div id="leftbar1"><strong>Пошук</strong>
<FORM>
<br><input type="search" name="search" placeholder="Шукати на сайті">
<input type="submit" value="Найти">
</FORM>
</div>

<?php
$file='';
$file_ip='';
$message='<br>';
$view_res=0;
if (isset($_POST['view_res']) and is_numeric($_POST['id'])) $view_res=1;
if (isset($_POST['vote']) and is_numeric($_POST['item'])
and is_numeric($_POST['id'])) {
 $f_name="vote".$_POST['id'].".txt";
 $f_ip="vote".$_POST['id']."_ip.txt";
 $ip=$_SERVER['REMOTE_ADDR'];

 $fh_ip=fopen($f_ip,"a+");
 flock($fh_ip,LOCK_EX);
 fseek($fh_ip,0);
 while (!feof($fh_ip)) $file_ip=fread($fh_ip,4096);
 if (array_search($ip,explode(",", $file_ip))!==FALSE) {
     $message="<b>Ви вже проголосували!</b><br>";
 }
 else if (file_exists($f_name)) {
    $fh=fopen($f_name,"a+");
    flock($fh,LOCK_EX);
    fseek($fh,0);
    while (!feof($fh)) $file=fread($fh,4096);
    $file=explode(",", $file);
    if ($_POST['item']>=0 and $_POST['item']<count($file)) $file[$_POST['item']]+=1;
    $file=implode(",",$file);
    ftruncate($fh,0);
    fwrite($fh,$file);
    flock($fh,LOCK_UN);
    fclose($fh);

    $file_ip.=$ip.',';
    fwrite($fh_ip,$ip.',');
    $message="<b>Ваш голос прийнятий!</b><br>";
 }
 $view_res=1;
 flock($fh_ip,LOCK_UN);
 fclose($fh_ip);
}

if ($view_res==1) {
 $f_name="vote".$_POST['id'].".txt";
    if (file_exists($f_name)) {
    $fh=fopen($f_name,"a+");
    flock($fh,LOCK_EX);
    fseek($fh,0);
    while (!feof($fh)) $file=fread($fh,4096);
    flock($fh,LOCK_UN);
    fclose($fh);
    $file=explode(",", $file);
    $summ=0;
    for ($n=0; $n<count($file); $n++) $summ+=$file[$n];
    if ($summ==0) $summ=1;
    for ($n=0; $n<count($file); $n++) $file[$n]=' - <b>'.$file[$n].
    '</b> ('.round(($file[$n]*100/$summ), 2).'%)';
 }
}

echo '<form method="POST" style="margin:0 0 0 35px;"><br><br><br><font size="4px" face="Giddyup Std" color="blue">Як вам мій сайт?</font>
    <input type="hidden" name="id" value="1">';
echo '<table border="0"><tr><td><input type="radio" name="item" value="0" checked>
    Відмінно</td><td>'.$file[0].'</td></tr>';
echo '<tr><td><input type="radio" name="item" value="1">Добре</td><td>'.
    $file[1].'</td></tr>';
echo '<tr><td><input type="radio" name="item" value="2">Задовільно</td><td>'.
    $file[2].'</td></tr>';
echo '<tr><td><input type="radio" name="item" value="3">Так собі</td><td>'.
    $file[3].'</td></tr>';
echo '<tr><td><input type="radio" name="item" value="4">Жахливо</td><td>'.
    $file[4].'</td></tr>';
echo '<tr><td colspan="2"><input type="submit" name="view_res" value="Результат">
    <input type="submit" name="vote" value="Голосувати">';
echo '</td></tr></table>'.$message.'</form>';
?>

<div id="leftbar2"><strong>Галерея</strong>
<img src="45.jpg" width=190px height=140px>
<img src="3.jpg" width=190px height=106px>
<img src="22.jpg" width=190px height=106px>
<img src="6.jpg" width=190px height=106px>
<img src="32.jpg" width=190px height=106px>
</div>
</div>
<div id="content">
<center><font size="6px" color="blue">Головна</font></center>
<p>Дослідницька компанія GfK представила 10 перспективних техно-трендів, які чинитимуть помітний вплив на глобальний ринок у найближчі кілька років. </p>
<p><font size="4px" color="blue">1. Мобільність. «Мобільний» тренд лише посилюється.</font> Він виражається в подальшому зростанні продажів «мобільних» і «розумних» пристроїв, а також поширенні мобільного інтернету. Очікується, що до 2019-го року більше 80% продажів мобільних послуг буде припадати на мобільний інтернет, а обсяг скачуваних даних зросте в 10 разів. Це відкриває нові можливості для зростання бізнесу телеком-операторів, виробників мобільного контенту, ринку мобільної реклами. У той же час, незважаючи на те, що зростання продажів мобільних пристроїв на розвинених ринках утруднений через насичення попиту, на ринках, що розвиваються, телеком-сегмент як і раніше залишиться одним з найбільш швидкозростаючих. </p>
<center><img src="45.jpg" width=620px height=386px></center>
<p><font size="4px" color="blue">2. Омні-екран.</font>  Вже зараз значна частка споживачів користується двома чи навіть трьома пристроями. У розвинених країнах, де рівень насичення попиту вже досить великий, ця цифра може становити від 20 до 60 відсотків аудиторії (як, наприклад, у Великобританії, де 60% опитаних в ході онлайн-дослідження GfK повідомили, що користуються як мінімум двома пристроями). Споживачі бажають мати безшовний і простий доступ до свого контенту — ділової і особистої інформації — з будь-якого свого пристрою. Забезпечити сумісність роботи пристроїв — це і виклик, і нові можливості для індустрії технологій. </p>
<p><font size="4px" color="blue">3. Відео-контент. </font> В епоху збільшення швидкостей і можливостей інтернет-доступу споживання відео-контенту істотно зросла. Цей тренд впливає на формування нової моди — широкоформатні смартфони («фаблет»), на яких майже також зручно дивитися відео, як на екрані планшетів. </p>
<p><font size="4px" color="blue">4. Переносна електроніка.</font> Ще один перспективний тренд, який підхопили практично всі великі виробники споживчої електроніки — носимі гаджети. З цієї серії — розумний годинник, окуляри та інші розумні аксесуари. Поки інтерес до цієї групи технологій є у техно-гиків, а масовий інтерес можна очікувати, коли будуть вирішені кілька завдань для цих пристроїв — модний дизайн плюс функціональність. Найбільш актуальні та перспективні напрямки розвитку функціональності носимих гаджетів — моніторинг параметрів здоров'я та різноманітні повідомлення. </p>
<img src="3.jpg" width=920px height=386px>
<p><font size="4px" color="blue">5. Мобільні платежі</font> — безконтактні платежі Хоча мобільні платежі самі по собі не є новинкою — зараз вони здійснюються через систему смс, додатки онлайн-банкінгу, мобільні додатки, — але ринок все більше придивляється до системи безконтактних платежів на базі технології NFC. Схоже, що ринок явно дозрів для того, щоб з'явився помітний гравець, здатний популяризувати безконтактні платежі. Тоді мобільний телефон стане ще й повноцінним платіжним засобом. </p>
<center><img src="22.jpg" width=720px height=400px></center>
<p><font size="4px" color="blue">6. Підключені або «розумні» автомобілі.</font>  Вже зараз розумні функції підключених до онлайн-систем автомобілів використовуються на ринку b2b, наприклад, в галузі транспорту і логістики — для моніторингу місцезнаходження, маршруту, швидкості, витрати палива; в області автострахування — для моніторингу використання функцій автомобіля; для відстеження якості водіння — вимірювання кількості екстрених гальмувань, середнього часу руху з підвищеною швидкістю тощо. Не за горами масове зростання попиту на розумні функції авто з боку споживачів. Основні переваги підключеного авто лежать в області безпеки, економії, розваг. Тут можна очікувати появи нових партнерств між автобрендами і телеком-операторами, що вже й відбувається. На недавньому Мобільному Конгресі в Барселоні були анонсовані партнерства Vodafone і Porsсhe, LG і Audi, AT&T і Cadillac. </p>
<p><font size="4px" color="blue">7. Розумний дім.</font>  Розумний дім — ще одна ілюстрація того, наскільки актуальним є сьогодні інтернет речей. За допомогою технологій розумного будинку споживачі можуть віддалено контролювати все в своєму житлі — від кави-машини і вмісту холодильника до освітлення і дверних замків. І вже зараз ряд вендорів пропонують спеціальні хаби або платформи, що дозволяють підключати нові пристрої. </p>
<img src="6.jpg" width=920px height=386px>
<p><font size="4px" color="blue">8. Великі дані.</font> Користуючись інтернетом, здійснюючи покупки, споживаючи відео-контент, ми залишаємо безліч слідів своєї діяльності, які складають неструктуровані великі масиви інформації. Одне з ключових питань, яке багато компаній, що володіють великими даними, намагаються вирішити — <font size="4px" color="blue">як монетизовувати і використовувати на благо споживачеві і бізнесу великі дані, не порушуючи приватності споживача та конфіденційності інформації.</font>  </p>
<p><font size="4px" color="blue">9. Інформаційна безпека. З розвитком технологій одна з найактуальніших тем </font> — як убезпечити зберігання даних, обмежити доступ до мобільного пристрою. У наш час мобільний телефон — це не тільки доступ до сторінок в соціальних мережах. Він може бути ключем до банківського рахунку, будинку і автомобілю. Біометрична безпека (на базі відбитків пальців і технологій розпізнавання осіб і очей (eye-tracking) — провідний напрямок у цій галузі.</p>
<p><font size="4px" color="blue">10. Розширена реальність.</font> Розширена реальність додає віртуальний шар до фізичного світу. Вона відкриває нові можливості застосування в найрізноманітніших областях і може повністю змінити споживчий досвід — від освіти та візитів у музеї до маршрутизації по місту і шопінгу. Ця технологія дозволяє «приміряти» вподобані меблі до своєї квартири. А модні бренди використовують віртуальну примірку, щоб зачарувати нас своїми колекціями.</p>
<br><img src="32.jpg" width=920px height=466px>
<div id="margin"><a href="" class="topbutton">Повернутися на початок</a></div>
</div>
</div>
<footer>by Anastasia Zvychaina &copy; 2016</footer>
</body>
</html>